CFD_OpenFOAM/0/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

topAndBottom
{
    type slip;
}

Front
{
    type empty;
}
Back
{
    type empty;
}
// ************************************************************************* //
