CFD_OpenFOAM/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    CAD
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(Front|Back|topAndBottom|inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    // AMI
    // {
    //     type            cyclicAMI;
    //     value           uniform 0;
    // }
    // AMI_slave
    // {
    //     type            cyclicAMI;
    //     value           uniform 0;
    // }
}


// ************************************************************************* //
