CFD_OpenFOAM/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh	dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so" );

solver solidBody;

solidBodyCoeffs
	{
		cellZone	innerAMI1;

		solidBodyMotionFunction rotatingMotion;
		rotatingMotionCoeffs
			{
				origin	(0 0 0);
				axis	(0 0 1);
				omega	-31.41892654; // rad/s
			}
	}