CFD_OpenFOAM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.1;
        smoother         GaussSeidel;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }
    UFinal
	{
		$U;
	}

    pFinal
    {
        $p;
    }
	pcorrFinal
	{
		$p;
	}

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    kFinal
    {
    	$k;
    }

    omega
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }
    
    omegaFinal
    {
    	$omega;
    }
}


PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}

relaxationFactors
{
    fields
    {
        p               0.18;
    }
    equations
    {
        "(U|k|omega)"   0.6;
        "(U|k|omega)Final" 0.8;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
